### 1 - Leitura e escrita de arquivos

In [1]:
# importando a biblioteca pandas
import pandas as pd

*Criando um DataFrame a partir de arquivos externos:*

In [3]:
# lendo um arquivo .csv
df = pd.read_csv('meu_arquivo.csv', encoding = 'ISO 8859-1', sep = ';')

In [4]:
df

    Nome  Idade       Sexo
0   João     21  Masculino
1  Maria     18   Feminino
2  Pedro     34  Masculino
3  Joana     25   Feminino

In [11]:
# lendo um arquivo .xlsx
df = pd.read_excel('meu_arquivo.xlsx')

In [12]:
df

    Nome  Idade       Sexo
0   João     21  Masculino
1  Maria     18   Feminino
2  Pedro     34  Masculino
3  Joana     25   Feminino

In [7]:
# lendo arquivos HTML
tabela_wiki = pd.read_html('https://en.wikipedia.org/wiki/Minnesota')

In [15]:
print(f'Total de tabelas: {len(tabela_wiki)}')

Total de tabelas: 28

In [17]:
# para selecionar uma tabela, colocar o índice em colchetes
tabela_wiki[1]

                   List of state symbols  \
                         Living insignia
0                                   Bird
1                              Butterfly
2                                   Fish
3                                 Flower
4                               Mushroom
5                                   Tree
6                     Inanimate insignia
7                               Beverage
8                                   Food
9                               Gemstone
10                                 Other
11                         State quarter
12                      Released in 2005
13  Lists of United States state symbols


                                    Living insignia.1
0                                         Common loon
1                                             Monarch
2                                             Walleye
3                       Pink-and-white lady's slipper
4                  Common morel (Morchella esculenta)
5                                      Norway pine[6]
6                                  Inanimate insignia
7                                                Milk
8   Fruit: Honeycrisp appleMuffin: BlueberryMushro...
9                                 Lake Superior agate
10                                  Photograph: Grace
11                                      State quarter
12                                   Released in 2005
13               Lists of United States state symbols

In [19]:
# importando apenas uma tabela específica
tabela_wiki_temp = pd.read_html('https://en.wikipedia.org/wiki/Minnesota', match='Average daily maximum and minimum temperatures for selected cities in Minnesota')

In [21]:
tabela_wiki_temp[0]

              Location July (°F) July (°C) January (°F) January (°C)
0          Minneapolis     83/64     28/18         23/7       −4/−13
1           Saint Paul     83/63     28/17         23/6       −5/−14
2            Rochester     82/63     28/17         23/3       −5/−16
3               Duluth     76/55     24/13         19/1       −7/−17
4            St. Cloud     81/58     27/14        18/−1       −7/−18
5              Mankato     86/62     30/16         23/3       −5/−16
6  International Falls     77/52     25/11        15/−6       −9/−21

*Criando um DataFrame a partir de uma lista:*

In [24]:
# criando uma lista de dados
dados = [[1, 'João', 'São Paulo'], [2, 'Maria', 'Rio de Janeiro'], [3, 'José', 'Belo Horizonte']]

# criando um DataFrame a partir da lista
df = pd.DataFrame(dados, columns=['id', 'nome', 'cidade'])

df.head()

   id   nome          cidade
0   1   João       São Paulo
1   2  Maria  Rio de Janeiro
2   3   José  Belo Horizonte

*Criando um DataFrame a partir de um dicionário:*

In [27]:
# criando um dicionário de dados:
dados = {'id': [1,2,3], 'nome': ['João', 'Maria', 'José'], 'cidade': ['São Paulo', 'Rio de Janeiro', 'Belo Horizonte']}

# criando um dataframe a partir do dicionário:
df = pd.DataFrame(dados)

df.head()

   id   nome          cidade
0   1   João       São Paulo
1   2  Maria  Rio de Janeiro
2   3   José  Belo Horizonte

*Criando um DataFrame a partir de uma lista de dicionários:*

In [29]:
# criando uma lista de dicionários:
dados = [{'id': 1, 'nome': 'João', 'cidade': 'São Paulo'},{'id': 2, 'nome': 'Maria', 'cidade': 'Rio de Janeiro'},{'id': 1, 'nome': 'José', 'cidade': 'Belo Horizonte'}]

# criando um DataFrame a partir de uma lista de dicionários:
df = pd.DataFrame(dados)

df.head()

   id   nome          cidade
0   1   João       São Paulo
1   2  Maria  Rio de Janeiro
2   1   José  Belo Horizonte

*Escrevendo DataFrames:*

In [32]:
# escrevendo um DataFrame em um arquivo .csv
df.to_csv('novo_arquivo_1.csv', index=False, encoding='ISO 8859-1')

# escrevendo um DataFrame em um arquivo .xlsx
df.to_excel('novo_arquivo_1.xlsx', index=False)